Documents/ПродажаИзделий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПродажаИзделий</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиИзделий</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПереченьНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПродажаИзделий/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПереченьНоменклатурыКоличествоПриИзменении(Элемент)
	СтрокаТаб = ЭтаФорма.Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументами.РассчетСуммы(СтрокаТаб);
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыСуммаПриИзменении(Элемент)
	СтрокаТаб = ЭтаФорма.Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументами.РассчетСуммы(СтрокаТаб);
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыНоменклатураПриИзменении(Элемент)
	СтрокаТабЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	Дата = Объект.Дата;
	Номенклатура = СтрокаТабЧасти.Номенклатура;
	
	СтрокаТабЧасти.Цена = РаботаСоСправочниками.ПрайсЦена(Дата, Номенклатура);
	
	РаботаСДокументами.РассчетСуммы(СтрокаТабЧасти);
	РассчитатьСуммуДокумента();
	
	Элементы.ПереченьНоменклатуры.Обновить();
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммуДокумента()
	СуммаДокумента = 0;
	
	Для каждого Строка Из Объект.ПереченьНоменклатуры Цикл
		СуммаДокумента = СуммаДокумента + Строка.Сумма;
	КонецЦикла;
	Объект.СуммаДокумента = СуммаДокумента;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФормуНаКлиенте() 
	РассчитатьСуммуДокумента();  
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыСтоимостьПриИзменении(Элемент)
	СтрокаТаб = ЭтаФорма.Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументами.РассчетСуммы(СтрокаТаб);
	РассчитатьСуммуДокумента();
КонецПроцедуры
